#ISU number: 338925
#Variant: 1
import re

regex = r"(\b[Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъьАа]+\b)|(\b[Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъьИи]+\b)|(\b[Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъьОо]+\b)|(\b[Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъьУу]+\b)|(\b[Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъьЫы]+\b)|(\b[Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъьЭэ]+\b)|(\b[Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъьЕе]+\b)|(\b[Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъьЁё]+\b)|(\b[Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъьЮю]+\b)|(\b[Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъьЯя]+\b)"

#basically:
#he have this thing
#\b[\w]+\b
#but it doesn't support cyrillic letters
#we change it to this
#\b[Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъь]+\b
#and at the end we add some vowel we are looking for

tests = ["Классное слово – обороноспособность, которое должно идти после слов: трава и молоко.",
         "Вариантом является различные наборы глаз, носов и ртов.",
         "Дан текст. Требуется найти тексте все фамилии, отсортировав их по алфавиту."]

#Expected test results:
#и
#слов
#идти
#слово
#трава
#должно
#молоко
#обороноспособность
#и
#глаз
#ртов
#носов
#их
#по
#дан
#все
#текст
#тексте


for test in tests:
    found = re.findall(regex, test)
    toPrint = []
    for result in found:
        toPrint.append(list(filter(None, result))[0])
    toPrint = sorted(toPrint, key=len)
    for i in toPrint:
        print(i)
